<a href="https://colab.research.google.com/github/therealellam/SQL/blob/main/Moringa_Data_Science_Prep_W2_Independent_Project_2019_06_Bellah_Ellam_SQL_Notebook.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#load the sql extension into our environment
%load_ext sql

#connect to the in memory sqlite database

%sql sqlite://

'Connected: @None'

In [ ]:
# Importing Pandas
import pandas as pd

In [ ]:
# Let's load our Grand electors dataset below
# 
with open('GrandElectors_by_state.csv','r') as f:
    GE = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql DROP TABLE if EXISTS GE;
%sql PERSIST GE;
%sql SELECT * FROM GE LIMIT 5;

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.

[('Alabama', 9),
 ('Alaska', 3),
 ('Arizona', 11),
 ('Arkansas', 6),
 ('California', 55)]

In [ ]:
# Let's load our population dataset below
#
with open('Population_by_state.csv','r') as f:
    pop = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql DROP TABLE if EXISTS pop;
%sql PERSIST pop;
%sql SELECT * FROM pop LIMIT 5;

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.

[('CALIFORNIA', 39144818),
 ('TEXAS', 27469114),
 ('FLORIDA', 20271272),
 ('NEW YORK', 19795791),
 ('ILLINOIS', 12859995)]

In [ ]:
#Exercise!: To join the 2 tables:
# You notice States are not capitalized the same way in both tables (one is in uppercase letters, the other not), 
# so you will first need to convert all to uppercase, for instance.
# Now you can join the tables on the state key.

%%sql
UPDATE GE SET State = UPPER(State)

select * from GE Limit 5;

 * sqlite://
51 rows affected.

[]

In [ ]:
#We create a new table which is joined using the state key
%%sql
CREATE TABLE New_table AS
SELECT GE.GrandElectors, pop.Population, pop.State 
FROM GE, pop
WHERE pop.State= GE.State

 * sqlite://
Done.
Done.

[]

In [ ]:
#we can now view all the columns in our new table
%%sql

SELECT * FROM New_table

 * sqlite://
Done.

[(9, 4858979, 'ALABAMA'),
 (3, 738432, 'ALASKA'),
 (11, 6828065, 'ARIZONA'),
 (6, 2978204, 'ARKANSAS'),
 (55, 39144818, 'CALIFORNIA'),
 (9, 5456574, 'COLORADO'),
 (7, 3590886, 'CONNECTICUT'),
 (3, 672228, 'DC'),
 (3, 945934, 'DELAWARE'),
 (29, 20271272, 'FLORIDA'),
 (16, 10214860, 'GEORGIA'),
 (4, 1431603, 'HAWAII'),
 (4, 1654930, 'IDAHO'),
 (20, 12859995, 'ILLINOIS'),
 (11, 6619680, 'INDIANA'),
 (6, 3123899, 'IOWA'),
 (6, 2911641, 'KANSAS'),
 (8, 4425092, 'KENTUCKY'),
 (8, 4670724, 'LOUISIANA'),
 (4, 1329328, 'MAINE'),
 (10, 6006401, 'MARYLAND'),
 (11, 6794422, 'MASSACHUSETTS'),
 (16, 9922576, 'MICHIGAN'),
 (10, 5489594, 'MINNESOTA'),
 (6, 2992333, 'MISSISSIPPI'),
 (10, 6083672, 'MISSOURI'),
 (3, 1032949, 'MONTANA'),
 (5, 1896190, 'NEBRASKA'),
 (6, 2890845, 'NEVADA'),
 (4, 1330608, 'NEW HAMPSHIRE'),
 (14, 8958013, 'NEW JERSEY'),
 (5, 2085109, 'NEW MEXICO'),
 (29, 19795791, 'NEW YORK'),
 (15, 10042802, 'NORTH CAROLINA'),
 (3, 756927, 'NORTH DAKOTA'),
 (18, 11613423, 'OHIO'),
 (7, 3911338, 'OKLAHOMA'),
 (7, 4028977, 'OREGON'),
 (20, 12802503, 'PENNSYLVANIA'),
 (4, 1056298, 'RHODE ISLAND'),
 (9, 4896146, 'SOUTH CAROLINA'),
 (3, 858469, 'SOUTH DAKOTA'),
 (11, 6600299, 'TENNESSEE'),
 (38, 27469114, 'TEXAS'),
 (6, 2995919, 'UTAH'),
 (3, 626042, 'VERMONT'),
 (13, 8382993, 'VIRGINIA'),
 (12, 7170351, 'WASHINGTON'),
 (5, 1844128, 'WEST VIRGINIA'),
 (10, 5771337, 'WISCONSIN'),
 (3, 586107, 'WYOMING')]

In [ ]:
#Exercise 2: Your boss wants you to change the name of the "District of Columbia" 
#state to its short version "DC". Please do that.

%%sql
UPDATE New_table SET State = 'DC'
WHERE State = 'DISTRICT OF COLUMBIA';

 * sqlite://
1 rows affected.

[]

In [ ]:
# %%sql
# CREATE VIEW
# joined
# AS
# SELECT replace(pop.state, district of columbia, DC) as state,population,grandelector.GE
# FROM pop
# INNER JOIN GE
# ON GE.State =Pop.state

In [ ]:
#Exercise 3: To compute the ratio between the number of grand electors and the population. 
#Please create a new column with that ratio
#my new column of the ratio is called My_ratio
%%sql  
SELECT *, CAST("GrandElectors" AS FLOAT)/CAST("Population" AS FLOAT) AS My_ratio FROM New_table 
LIMIT 5;

 * sqlite://
Done.

[(9, 4858979, 'ALABAMA', 1.8522409749043987e-06),
 (3, 738432, 'ALASKA', 4.0626625065002604e-06),
 (11, 6828065, 'ARIZONA', 1.610998137832607e-06),
 (6, 2978204, 'ARKANSAS', 2.0146370094190997e-06),
 (55, 39144818, 'CALIFORNIA', 1.4050391037710278e-06)]

In [ ]:
#Exercise 4: To order the states by decreasing ratio of Grand Electors per capita. That will make our priority list.
#lets create a new ratio column of grand electors per capita
%%sql  
SELECT *, ("Population")/("GrandElectors") AS My_ratio2 FROM New_table 
ORDER BY My_ratio2 DESC LIMIT 5;

 * sqlite://
Done.

[(38, 27469114, 'TEXAS', 722871),
 (55, 39144818, 'CALIFORNIA', 711723),
 (29, 20271272, 'FLORIDA', 699009),
 (29, 19795791, 'NEW YORK', 682613),
 (15, 10042802, 'NORTH CAROLINA', 669520)]

In [ ]:
#Exercise 5: To compute the running total of Grand Electors in that sorted list.

%%sql
SELECT SUM(GrandElectors) AS Total_Grand_Electors FROM New_table

 * sqlite://
Done.

[(538,)]

In [ ]:
# Exercise 6: Independently, to compute the half of the total of Grand Electors overall (in the whole country):
# This is the threshold we need to reach for winning the presidential election.

%%sql
SELECT SUM(GrandElectors)/2 FROM New_table

 * sqlite://
Done.

[(269,)]

In [ ]:
%sql select running_total.state from running_total where RunningTotal <= 269 order by

In [ ]:
# To filter our sorted list of states in order to keep only the (top) ones enabling us to reach the computed threshold. 
# (the other states can be ignored). That is our target list.
# Hint: You can do that in 2 steps:
# Select all the states for which the running total is below or equal to the threshold.
# Add the first state for which the running total is larger than the threshold.
%%sql

SELECT State FROM New_table
WHERE GrandElectors<=269